#include <REGX52.H>


//*************************************************

//功能：UART初始化
//返回类型：无
//形参：无

//*************************************************
void  UART_Init()
{
	SCON = 0x50;
	PCON |= 0x80;
	TMOD &= 0x0f;
	TMOD |= 0x20;
	TR1 = 1;
	TH1 = 0xf4;
	TL1 = 0xf4;
	ET1 = 0;
	ES = 1;
	EA = 1;
}



//*************************************************

//功能：UART发送数据
//返回类型：无
//形参：unsigned 发送的数据

//*************************************************
void UART_Send(unsigned char byte)
{
	SBUF = byte;
	while(!TI);
	TI = 0;
}


