//#include <REGX52.H>


////定义断码数组
//char arr[] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};



//void temp(int num , int num1)
//{
//	//通过运算转换二进制给片选
//	P2_2 = num%2;
//	num /= 2;
//	P2_3 = num%2;
//	num /= 2;
//	P2_4 = num%2;

//	P0 = arr[num1];	
//	
//}

//int main()
//{
//	//------------------------------------------   静态数码管显示6
//	//片选通过138译码器工作，来确定片选
//	 
//	//第三位显示六
//	//通过三八译码器确定片选。看图
////	P2_2 = 1;
////	P2_3 = 0;
////	P2_4 = 1;
////	//断码
////	P0 = 0X7d;
//	
//	//------------------------------------------   通过子函数
//	//临时测试函数,形参列表（第几个数码管亮，亮的数字）
//	//数码管范围 0-7
//	temp(7,6);
//		

//	
//	
//	
//	
//	return 0;
//}